public class Div {
    public static void main(String[] args) {
        long เวลาเริ่มต้น = System.currentTimeMillis();
        int ขนาดข้อมูล = 9999;
        if (args.length == 1)
            ขนาดข้อมูล = Integer.parseInt(args[0]);
        int ตัวตั้ง = 1;
        int ตัวหาร = ขนาดข้อมูล;
        for (ตัวหาร = 1; ตัวหาร <= ขนาดข้อมูล; ตัวหาร++) {
            int ผลหารจำนวนเต็ม = ตัวตั้ง / ตัวหาร;
            int เศษเหลือ = ตัวตั้ง % ตัวหาร;
            StringBuffer เลขทศนิยม = new StringBuffer(ตัวหาร);
            int ทศนิยมซ้ำ = -1;
            int[] รายการเศษเหลือ = new int[ตัวหาร];
            int ทศนิยม = 0;
            while (ทศนิยมซ้ำ < 0 && เศษเหลือ != 0 && ทศนิยม < ตัวหาร) {
                รายการเศษเหลือ[เศษเหลือ] = ทศนิยม + 1;
                เศษเหลือ *= 10;
                เลขทศนิยม.append(เศษเหลือ / ตัวหาร);
                เศษเหลือ = เศษเหลือ % ตัวหาร;
                ทศนิยมซ้ำ = รายการเศษเหลือ[เศษเหลือ] - 1;
                ทศนิยม++;
            }
            ทศนิยมซ้ำ = ทศนิยม - ทศนิยมซ้ำ;
            System.out.printf("%4d/%-4d [%2d][%4d]\t%4d.", ตัวตั้ง, ตัวหาร, ทศนิยมซ้ำ, ทศนิยม,
                    ผลหารจำนวนเต็ม);
            System.out.println(เลขทศนิยม.substring(0,
                    (เลขทศนิยม.length() > 50 ? 50 : เลขทศนิยม.length())));
        }
        System.out.println("ใช้เวลา " +
                (System.currentTimeMillis() - เวลาเริ่มต้น) / 1000.0 + " วินาที");
    }
}